In [1]:
import pandas as pd

## from DataFrame

In [2]:
summer = pd.read_csv('summer.csv')

In [3]:
summer.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [4]:
summer.Athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [5]:
summer['Athlete']

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [9]:
summer.iloc[0] #pandas series by selecting one row

Year                    1896
City                  Athens
Sport               Aquatics
Discipline          Swimming
Athlete        HAJOS, Alfred
Country                  HUN
Gender                   Men
Event         100M Freestyle
Medal                   Gold
Name: 0, dtype: object

## Importing from CSV

In [12]:
pd.read_csv('summer.csv', usecols = ['Athlete'], squeeze = True) #squeeze = True returns a pandas series

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [13]:
pd.read_csv('summer.csv', usecols = ['Athlete'], squeeze = False) #squeeze = True returns a pandas dataframe

                         Athlete
0                  HAJOS, Alfred
1               HERSCHMANN, Otto
2              DRIVAS, Dimitrios
3             MALOKINIS, Ioannis
4             CHASAPIS, Spiridon
...                          ...
31160         JANIKOWSKI, Damian
31161  REZAEI, Ghasem Gholamreza
31162             TOTROV, Rustam
31163          ALEKSANYAN, Artur
31164             LIDBERG, Jimmy

[31165 rows x 1 columns]

## Creating from scratch

In [14]:
pd.Series([10,25,6,36,2])

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [16]:
pd.Series([10,25,6,36,2], index = ['Mon','Tue','Wed','Thurs','Fri'])

Mon      10
Tue      25
Wed       6
Thurs    36
Fri       2
dtype: int64

In [17]:
pd.Series([10,25,6,36,2], index = ['Mon','Tue','Wed','Thurs','Fri'], name = 'Sales')

Mon      10
Tue      25
Wed       6
Thurs    36
Fri       2
Name: Sales, dtype: int64